In [1]:
import pandas as pd

# Importing Data
pd.read_csv(FILE_ADDRESS) is used to import data; File address can be a relative address or an URL.

In [2]:
car_sales_df = pd.read_csv("./data/car-sales.csv")
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Exporting data
data.to_csv(FILE_ADDRESS, index=False) can be used to export python objects as a csv file

In [3]:
car_sales_df.to_csv("./data/exported-car-sales.csv")

# Describing Data with Pandas
## Atributes
- data.dtypes
- data.columns
- data.index

## Methods
- data.describe() --> Some statistical information about the numeric columns.
- data.info()
- data.mean()
- data.sum()
- data.median()

## Functions
len(data)

In [4]:
car_sales_df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [5]:
car_sales_df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [6]:
car_sales_df.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
car_sales_df.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [8]:
car_sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [9]:
car_sales_df.mean()

/var/folders/vs/6l8sy6cj0db7f5v682_f44xh0000gn/T/ipykernel_5799/3029920428.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  car_sales_df.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [10]:
car_sales_df["Doors"].sum()

40

In [11]:
car_sales_df.median()

/var/folders/vs/6l8sy6cj0db7f5v682_f44xh0000gn/T/ipykernel_5799/2502231798.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  car_sales_df.median()

Odometer (KM)    57369.0
Doors                4.0
dtype: float64

# Selecting & Viewing Data
- data.head(NUMBER_OF_ROWS)
- data.tail(NUMBER_OF_ROWS)
- data.loc(NUMBER_OF_Index)
- data.iloc(NUMBER_OF_Row)

In [12]:
car_sales_df[car_sales_df["Make"] == "Toyota"][car_sales_df["Colour"] == "White"]

/var/folders/vs/6l8sy6cj0db7f5v682_f44xh0000gn/T/ipykernel_5799/2726468272.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  car_sales_df[car_sales_df["Make"] == "Toyota"][car_sales_df["Colour"] == "White"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
8  Toyota  White          60000      4  $6,250.00

In [13]:
pd.crosstab(car_sales_df["Make"], car_sales_df["Colour"])

Colour  Black  Blue  Green  Red  White
Make
BMW         1     0      0    0      0
Honda       0     2      0    1      0
Nissan      0     0      0    0      2
Toyota      0     1      1    0      2

In [14]:
car_sales_df.groupby("Make").mean()

/var/folders/vs/6l8sy6cj0db7f5v682_f44xh0000gn/T/ipykernel_5799/2436372806.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  car_sales_df.groupby("Make").mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [15]:
obj = {"Email": ["mmmohajer70@gmail.com", "adelkhanin@gmail.com"], "Name": ["Mohammad Mohajer", "Niloofar Adelkhani"]}
df = pd.DataFrame(obj)
df["Email"][0] = "mohammadmohajer7091@gmail.com"
df

                           Email                Name
0  mohammadmohajer7091@gmail.com    Mohammad Mohajer
1           adelkhanin@gmail.com  Niloofar Adelkhani

# Data Manipulation
- data.fillna(0, inplace=True)
- data.dropna(0, inplace=True)
- data.drop("COLUMN_NAME", axis=1, inplace=True)
- data.sample(frac=0.5)
- data.reset_index(drop=True, inplace=True)
- data.apply(lambda x: x * 2)

In [16]:
car_sales_df.drop("Make", axis=1)

  Colour  Odometer (KM)  Doors       Price
0  White         150043      4   $4,000.00
1    Red          87899      4   $5,000.00
2   Blue          32549      3   $7,000.00
3  Black          11179      5  $22,000.00
4  White         213095      4   $3,500.00
5  Green          99213      4   $4,500.00
6   Blue          45698      4   $7,500.00
7   Blue          54738      4   $7,000.00
8  White          60000      4   $6,250.00
9  White          31600      4   $9,700.00